# Popularity Based Recommender System
 
en cok popüler olan ürünü tavsiye etme

In [1]:
import pandas as pd

In [9]:
ratings=pd.read_csv("ml-100k/u.data",sep="\t",header=None,names=["user_id","movie_id","rating"],usecols=range(3))
# csv: Coma Seperated Values
# ancak burdaki sey Tab ile ayrilmis(\t var burda)
# sep (seperator) yazinca virgül yapiyor?
# simdide birinci satir veri -> header=None: ilk satiri baslik gibi almiyor
# suan data ok, ama columns names bilmiyoruz
# names= ile isim veriyoruz ancak son sutün ne bilmiyoruz, onu almiyoruz usecols=range(3), son sütunu almadik

In [10]:
ratings.head()

   user_id  movie_id  rating
0      196       242       3
1      186       302       3
2       22       377       1
3      244        51       2
4      166       346       1

In [11]:
movies=pd.read_csv("ml-100k/u.item",sep="|",header=None,encoding="iso-8859-1",names=["movie_id","title"],usecols=range(2))

veri tabanin dizayn da takip ettigimis bir sey var:
1. DRY - dont repeat - veri tekrarini engelle

In [12]:
movies.head()

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

In [13]:
ratings=pd.merge(movies,ratings)

In [14]:
ratings.head()

   movie_id             title  user_id  rating
0         1  Toy Story (1995)      308       4
1         1  Toy Story (1995)      287       5
2         1  Toy Story (1995)      148       4
3         1  Toy Story (1995)      280       4
4         1  Toy Story (1995)       66       3

In [15]:
# en popüler filmi nasil bulacagiz? en cok ismi gecen
# rating ortalama bakinaca mesela bir kisi 5 vermistir, 1 kisiye bakilmaz en az 3 kaynaktan dogrulamak lazim
# kac tane filim var ona bi bakalim

In [17]:
ratings.title.nunique()

1664

In [18]:
import numpy as np

In [19]:
# gruplara ayiriyoruz filimleri

In [20]:
grouped=ratings.groupby("title").agg({"rating":[np.size,np.sum,np.mean]})

In [21]:
grouped.head()
#size= kac kisi bu filim hakkinda yorum yapmis
#sum= yorumlarin toplam adedi 21
#mean= ortalama ne kadar rating verilmis

                          rating
                            size  sum      mean
title
'Til There Was You (1997)      9   21  2.333333
1-900 (1994)                   5   13  2.600000
101 Dalmatians (1996)        109  317  2.908257
12 Angry Men (1957)          125  543  4.344000
187 (1997)                    41  124  3.024390

In [22]:
populer=grouped.sort_values(("rating","mean"),ascending=False)

In [23]:
populer.head()

                                           rating
                                             size sum mean
title
They Made Me a Criminal (1939)                  1   5  5.0
Marlene Dietrich: Shadow and Light (1996)       1   5  5.0
Saint of Fort Washington, The (1993)            2  10  5.0
Someone Else's America (1995)                   1   5  5.0
Star Kid (1997)                                 3  15  5.0

In [24]:
toplam=grouped["rating"]["sum"].sum()

In [26]:
toplam # yüzdesine göre toplayacam icin hepsini hesapladik

352986

In [27]:
populer["percentage"]=populer["rating","sum"].div(toplam)*100

In [28]:
populer.head()

                                           rating          percentage
                                             size sum mean
title
They Made Me a Criminal (1939)                  1   5  5.0   0.001416
Marlene Dietrich: Shadow and Light (1996)       1   5  5.0   0.001416
Saint of Fort Washington, The (1993)            2  10  5.0   0.002833
Someone Else's America (1995)                   1   5  5.0   0.001416
Star Kid (1997)                                 3  15  5.0   0.004249

In [29]:
populer.sort_values(("percentage"),ascending=False)

                                          rating                 percentage
                                            size   sum      mean
title
Star Wars (1977)                             583  2541  4.358491   0.719859
Fargo (1996)                                 508  2111  4.155512   0.598041
Return of the Jedi (1983)                    507  2032  4.007890   0.575660
Contact (1997)                               509  1936  3.803536   0.548464
Raiders of the Lost Ark (1981)               420  1786  4.252381   0.505969
...                                          ...   ...       ...        ...
Getting Away With Murder (1996)                1     1  1.000000   0.000283
The Courtyard (1995)                           1     1  1.000000   0.000283
Promise, The (Versprechen, Das) (1994)         1     1  1.000000   0.000283
JLG/JLG - autoportrait de décembre (1994)      1     1  1.000000   0.000283
Crude Oasis, The (1995)                        1     1  1.000000   0.000283

[1664 rows x 4 columns]

In [30]:
# müsterim hakkinda hic bir bilgim yoksa Star Wars tavsiye edecegim, onu izlediyse Fargo..